import React from 'react'

export const Glossary = () => {
    return (
        <div>
            <h1>Глоссарий</h1>
            <p><b>Уведомления</b> - Нотификации дают юзеру понять, что есть что-то новое, например, сообщение или какое-то
                системное уведомление.
            </p>
            <p><b>Пагинация (Pagination)</b>
                - Обычно находящийся в нижней части страницы. Пагинация помогает легко "браузить"
                страницы сайта находя нужную вам страницу.
            </p>
            <p><b>Picker</b>
                - Преимущество использования пикеров над полями ввода (input field) заключается в том, что все
                пользователи выбирают данные и они в нужном формате сохраняются в базе данных, что делает информацию
                управляемой и легкой для доступа. В инпуте ж нужно писать парсеры и распознаватели разных типов введенных
                данных.
            </p>
            <p><b>Progress Bar</b>
                - Progress Bar помогает визуализировать, на каком шаге находится пользователь. Обычно вы найдете их
                на оформлении заказов, отмечая различные этапы, которые пользователь должен выполнить для завершения покупки,
                такие как выставление счетов и отгрузка.
            </p>
            <p><b>Radio Buttons</b>- Radio Buttons похожи на чекбоксы, но отличаются тем, что можно 1 из нескольких вариантов.
            </p>
            <p><b>Поле поиска (Search Field)</b>
                - один из важнейших элементов пользовательского интерфейса на веб-странице. n его
                помощью пользователь может найти нужный контент на вашем сайте</p>
            <p><b>Боковая панель (Sidebar)</b>- Sidebar нужен для отображения дополнительного контента, который не предназначен для
                основного блока
            </p>
            <p><b>Ползунок (Slider Controls)</b>
                - Slider это общий элемент пользовательского интерфейса, используемый для выбора
                значения или диапазона значений. Перетаскивая ползунок пальцем или мышью, пользователь может постепенно и
                точно регулировать значение - например, об+ем, яркость или желаемый диапазон цен при совершении покупок.
            </p>
            <p><b>Stepper</b> - это элементы управления, которые позволяют пользователям регулировать значение. Однако, в отличие от
                ползунков, они позволяют пользователям изменять значение только в заранее определенных диапазонах, с заранее
                установленым шагом
            </p>c:\Users\Admin\Desktop\nadira\meeting-club
            <p><b>Тэг (Tag)</b>
                - В дизайне пользовательского интерфейса теги - это, по сути, метки, которые помогают маркировать и
                классифицировать контент. Обычно они состоят из релевантных ключевых слов, которые облегчают поиск и просмотр
                соответствующего фрагмента контента. Tэги часто используются на социальных сайтах и в блогах.
            </p>
            <p><b>Tab Bar</b>r
                - Панели вкладок отображаются в нижней части мобильного приложения и позволяют пользователям быстро
                перемещаться между основными разделами приложения.
            </p>
            <p><b>Tooltip</b> - это небольшие подсказки, которые помогают пользователям понять часть или процесс в интерфейсе.
            </p>
            <p><b>Toggle</b> - это флаг который позволяет выбрать между lа или Нет.
            </p>
        </div>
    )
}
