import React from 'react'

export const Glossary = () => {
    return (
        <div>
            <h1>Глоссарий</h1>
            <p><b>Ui — User Interface (Пользовательский Интерфейс)</b> — т.е. это та часть, которую Вы видите. Все те кнопки, иконки, плажки и пр., с которыми Вы взаимодействуете каждый раз, когда открываете сайт, программу, приложение и др.</p>
            <p><b>Ux — User Experience (Пользовательский Опыт)</b> — пользовательский опыт, получаемый в ходе взаимодействия с интерфейсом сайта, сервиса, продукта или услуги.
                Часто тема user experience возникает при обсуждении юзабилити-сайта. Однако удобство интерфейса – лишь один из компонентов, из которых складывается пользовательский опыт.</p>
            <p><b>Guidelines (Гайдлайны)</b> — Это наборы правил, которые описаны в рамках дизайн-системы, например Material Design, iOs и пр.</p>
            <p><b>Visual Design (Визуальный Дизайн)</b> — Исключительно визуальная часть работы дизайнера, то что можно увидеть.</p>
            <p><b>Ui Kit</b> — набор элементов используемых в построении интерфейса. Такой-себе конструктор, с которого состоит дизайн.</p>
            <p><b>Design system (Дизайн система)</b> — правила, компоненты, спецификации и пр., что задает общий тон всему дизайну, в рамках проекта. Фактически это своеобразный Гайдлайн.</p>
            <p><b>Аккордеоны (Accordion)</b> - Аккордеоны позволяют пользователям расширять и сворачивать разделы контента. Они помогают пользователям быстро перемещаться по материалам и позволяют дизайнеру пользовательского интерфейса включать большие объемы информации в ограниченном пространстве.</p>
            <p><b>Bento Menu, Döner Menu, Hamburger Menu, Kebab Menu, Alt-burger, meatball
                bento</b> - Типы иконок меню, которые названы в честь блюд. Используются очень часто в качестве отображения меню.</p>
            <p><b>Хлебные крошки (Breadcrumb)</b> - Хлебные крошки (навигационная цепочка, англ. Breadcrumbs) – это элемент навигации по сайту, который представляет собой путь от корня сайта, до текущей страницы, на которой в настоящий момент находится пользователь. Хлебные крошки обычно представляют собой полосу в верхней части страницы, обычно под шапкой сайта.</p>
            <p><b>Кнопка (Button)</b> - Кнопки позволяют пользователю взаимодействовать с формами на сайте.
            </p>
            <p><b>Карточка (Card)</b> - Карточки на данный момент довольно популярны среди UI/UX. Карточки – это небольшие прямоугольные или квадратные модули, которые содержат различную информацию - в виде кнопок, текста, мультимедиа и т.д. Карточки - отличный выбор дизайна пользовательского интерфейса, если вы хотите разумно использовать доступное пространство и предоставить пользователю несколько вариантов содержимого, не заставляя их прокручивать традиционный список.</p>
            <p><b>Карусель (Carousel)</b> - Карусели позволяют пользователям просматривать наборы контента, такие как изображения или открытки, часто гиперссылки на большее количество контента или источников. Самым большим преимуществом использования каруселей в дизайне UI является то, что они позволяют нескольким фрагментам контента занимать одну и ту же область пространства на странице или экране.</p>
            <p><b>Checkbox</b> - Чекбокс это флаг который позволяет выбрать учитывать этот элемент или нет (например при выборе параметров товара).</p>
            <p><b>Выпадающий список (Dropdown)</b> – это элемент интерфейса, обычно представляющий собой некоторое меню, которое показывается только после того, как пользователь нажал на некоторый элемент или навёл на него курсор.</p>
            <p><b>Форма (Form)</b> - форма в дизайне может быть определена как выражение внешнего вида (стайлинга) изделия исходя из его внутреннего содержания и предназначения.
            </p>
            <p><b>Иконки (Icon)</b> - элемент графического интерфейса, небольшая картинка, обозначающая приложение, файл, каталог, окно, компонент операционной системы, устройство и т. п.</p>
            <p><b>Поле ввода (Input Field)</b> - базовый компонент интерфейса, предназначенный для ввода небольшого объема текста.</p>
            <p><b>Loader,
                ping pong loader</b> - Loader'ы могут принимать самые разные формы. Дизайнеры любят с ними экспериментировать. Loader'ы предназначены для отображения индикатора загрузки, пока на фоне отрабатывает какой-то экшн.</p>
            <p><b>Модальное окно (popup)</b> - Модальное окно - это блок, содержащий контент или сообщение, которое требует от вас взаимодействия с ним, прежде чем вы сможете закрыть его и вернуться к основному контенту.</p>
            <p><b>Уведомления</b> - Нотификации дают юзеру понять, что есть что-то новое, например, сообщение или какое-то
                системное уведомление.
            </p>
            <p><b>Пагинация (Pagination)</b>
                - Обычно находящийся в нижней части страницы. Пагинация помогает легко "браузить"
                страницы сайта находя нужную вам страницу.
            </p>
            <p><b>Picker</b>
                - Преимущество использования пикеров над полями ввода (input field) заключается в том, что все
                пользователи выбирают данные и они в нужном формате сохраняются в базе данных, что делает информацию
                управляемой и легкой для доступа. В инпуте ж нужно писать парсеры и распознаватели разных типов введенных
                данных.
            </p>
            <p><b>Progress Bar</b>
                - Progress Bar помогает визуализировать, на каком шаге находится пользователь. Обычно вы найдете их
                на оформлении заказов, отмечая различные этапы, которые пользователь должен выполнить для завершения покупки,
                такие как выставление счетов и отгрузка.
            </p>
            <p><b>Radio Buttons</b>- Radio Buttons похожи на чекбоксы, но отличаются тем, что можно 1 из нескольких вариантов.
            </p>
            <p><b>Поле поиска (Search Field)</b>
                - один из важнейших элементов пользовательского интерфейса на веб-странице. n его
                помощью пользователь может найти нужный контент на вашем сайте</p>
            <p><b>Боковая панель (Sidebar)</b>- Sidebar нужен для отображения дополнительного контента, который не предназначен для
                основного блока
            </p>
            <p><b>Ползунок (Slider Controls)</b>
                - Slider это общий элемент пользовательского интерфейса, используемый для выбора
                значения или диапазона значений. Перетаскивая ползунок пальцем или мышью, пользователь может постепенно и
                точно регулировать значение - например, об+ем, яркость или желаемый диапазон цен при совершении покупок.
            </p>
            <p><b>Stepper</b> - это элементы управления, которые позволяют пользователям регулировать значение. Однако, в отличие от
                ползунков, они позволяют пользователям изменять значение только в заранее определенных диапазонах, с заранее
                установленым шагом
            </p>c:\Users\Admin\Desktop\nadira\meeting-club
            <p><b>Тэг (Tag)</b>
                - В дизайне пользовательского интерфейса теги - это, по сути, метки, которые помогают маркировать и
                классифицировать контент. Обычно они состоят из релевантных ключевых слов, которые облегчают поиск и просмотр
                соответствующего фрагмента контента. Tэги часто используются на социальных сайтах и в блогах.
            </p>
            <p><b>Tab Bar</b>r
                - Панели вкладок отображаются в нижней части мобильного приложения и позволяют пользователям быстро
                перемещаться между основными разделами приложения.
            </p>
            <p><b>Tooltip</b> - это небольшие подсказки, которые помогают пользователям понять часть или процесс в интерфейсе.
            </p>
            <p><b>Toggle</b> - это флаг который позволяет выбрать между lа или Нет.
            </p>
        </div>
    )
}
